#!/usr/local/bin/python3
# coding: utf-8

# ytdlbot - constant.py
# 8/16/21 16:59
#

__author__ = "Benny <benny.think@gmail.com>"

import typing

from pyrogram import Client, types


class BotText:

    start = """
🎉 ברוכים הבאים לבוט הורדות המדיה! 🎥🎵
שלחו לי קישור ואני אדאג להוריד עבורכם סרטונים, שירים וקבצי מדיה במהירות 🚀

🔹 מה הבוט יודע לעשות?
• הורדת וידאו ואודיו מאתרים פופולריים כמו YouTube, Instagram, TikTok, SoundCloud, Reddit ועוד כ 1500 אתרים פופולאריים.
• תמיכה גם בקישורי הורדה ישירה לקבצי מדיה
• שליחה אוטומטית של הקובץ ישירות לטלגרם

🔹 פקודות שימושיות:
/start - התחלה
/help - עזרה ומידע נוסף
‏ℹ️ שימו לב: קישורים פרטיים או מוגנים לא תמיד נתמכים.
שלחו קישור ונתחיל ⬇️😄
    """

    help = """
🤖 מדריך שימוש בבוט ההורדות
הבוט מאפשר הורדה של סרטונים, שירים וקבצי מדיה מאתרים פופולריים וגם מקישורי הורדה ישירה.

🔹 איך מורידים?
• פשוט שלחו קישור לתוכן הרצוי
• הבוט יזהה אוטומטית את האתר והפורמט
• הקובץ יישלח אליכם ישירות לטלגרם 📥

🔹 אתרים נתמכים (חלקי):
YouTube, Instagram, TikTok, Facebook, Twitter (X), SoundCloud, Reddit
וגם קישורי הורדה ישירה לקבצי וידאו או אודיו

🔹 פקודות זמינות:
/start: הודעת התחל.
/help, /about: מידע ועזרה.
/settings: הגדרת איכות (פורמט.
/buy: רכישת מנוי VIP.
/stats: הצגת סטטיסטיקות שרת.
/direct: הורדה ישירה מלינק.
/spdl: הורדה מאתרים ספציפיים.
/ping: בדיקת מהירות תגובה.

🔹 מה אפשר להוריד?
  • 🎥 סרטונים
  • 🎵 אודיו ושירים
  • 📁 קבצי מדיה ישירים

‏ℹ️ הערות חשובות:
• איכות ההורדה נבחרת אוטומטית לפי הזמינות
• קישורים פרטיים, מוגנים או בתשלום עשויים לא לעבוד
• יש להשתמש בתוכן באחריות ובהתאם לזכויות יוצרים
שלחו קישור והבוט כבר ידאג לשאר 🚀⬇️
• לכל משתמש יש מכסת הורדות יומית כדי שהבוט יישאר מהיר וזמין לכולם.
רוצים להוריד יותר?
שלחו לי הודעה פרטית ואפתח לכם גישה מורחבת בתשלום קטן. 💸

    """

    about = "בוט הורדות יוטיוב נבנה על ידי @BennyThink.\n\nקוד פתוח ב-GitHub: https://github.com/tgbot-collection/ytdlbot"

    settings = """


⚙️ **הגדרות הורדה**

אנא בחרו את האיכות והפורמט המועדפים עליכם.
הגדרות אלו תקפות **רק לסרטוני יוטיוב**.

🎥 **איכויות:**
• גבוהה: 1080P
• בינונית: 720P
• נמוכה: 480P

📂 **סוג משלוח:**
יש בוטים המאפשרים שליחה כקובץ (Document) או כוידאו (Video).
*שימו לב: שליחה כקובץ לא תאפשר ניגון ישיר בטלגרם.*

📝 **ההגדרות הנוכחיות שלך:**
איכות וידאו: {}
סוג משלוח: {}
"""

    youtube_quality_select = """
🎬 **בחר איכות להורדה**

📹 **{}**
⏱️ משך: {}

👇 בחר את האיכות הרצויה:
"""


class Types:
    Message = typing.Union[types.Message, typing.Coroutine]
    Client = Client
