import typing

from pyrogram import Client, types


class BotText:

    start = """
🎉 ברוכים הבאים לבוט הורדות המדיה! 🎥🎵
שלחו לי קישור ואני אדאג להוריד עבורכם סרטונים, שירים וקבצי מדיה במהירות 🚀

🔹 מה הבוט יודע לעשות?
• הורדת וידאו ואודיו מאתרים פופולריים כמו YouTube, Instagram, TikTok, SoundCloud, Reddit ועוד כ 1500 אתרים פופולאריים.
• תמיכה גם בקישורי הורדה ישירה לקבצי מדיה
• שליחה אוטומטית של הקובץ ישירות לטלגרם

🔹 פקודות שימושיות:
/start - התחלה
/help - עזרה ומידע נוסף
‏ℹ️ שימו לב: קישורים פרטיים או מוגנים לא תמיד נתמכים.
שלחו קישור ונתחיל ⬇️😄
    """

    help = """
🤖 מדריך שימוש בבוט ההורדות
הבוט מאפשר הורדה של סרטונים, שירים וקבצי מדיה מאתרים פופולריים וגם מקישורי הורדה ישירה.

🔹 איך מורידים?
• פשוט שלחו קישור לתוכן הרצוי
• הבוט יזהה אוטומטית את האתר והפורמט
• הקובץ יישלח אליכם ישירות לטלגרם 📥

🔹 אתרים נתמכים (חלקי):
YouTube, Instagram, TikTok, Facebook, Twitter (X), SoundCloud, Reddit
וגם קישורי הורדה ישירה לקבצי וידאו או אודיו

🔹 פקודות זמינות:
/start: הודעת התחל.
/help, /about: מידע ועזרה.
/settings: הגדרת איכות פורמט ועוד.
/buy: רכישת מנוי VIP.
/stats: הצגת סטטיסטיקות שרת.
/direct: הורדה ישירה מלינק.
/spdl: הורדה מאתרים ספציפיים.
/ping: בדיקת מהירות תגובה.

🔹 מה אפשר להוריד?
  • 🎥 סרטונים
  • 🎵 אודיו ושירים
  • 📁 קבצי מדיה ישירים

‏ℹ️ הערות חשובות:
• איכות ההורדה נבחרת אוטומטית לפי הזמינות
• קישורים פרטיים, מוגנים או בתשלום עשויים לא לעבוד
• יש להשתמש בתוכן באחריות ובהתאם לזכויות יוצרים
• לכל משתמש יש מכסת הורדות יומית כדי שהבוט יישאר מהיר וזמין לכולם.
רוצים להוריד יותר?
שלחו לי הודעה פרטית ואפתח לכם גישה מורחבת בתשלום קטן. 💸

    """

    about = "בוט הורדות יוטיוב נבנה על ידי @BennyThink.\nשופר רבות ומופעל על ידי @YD_IL\n\nקוד פתוח ב-GitHub: https://github.com/tgbot-collection/ytdlbot"

    settings = """
⚙️ **הגדרות הורדה (YouTube)**
בחר איכות וידאו וצורת שליחה.

🎥 **איכות:** 1080p | 720p | 480p
📤 **שליחה:** וידאו (צפייה ישירה) | קובץ (לא מתנגן)
📝 **כתוביות:** פעיל / כבוי
📑 **אורך כותרת:** 100 / 250 / 500 / 1000 תווים
"""

    youtube_quality_select = """
🎬 **בחר איכות להורדה**

📹 **{}**
⏱️ משך: {}

👇 בחר את האיכות הרצויה:
"""


class Types:
    Message = typing.Union[types.Message, typing.Coroutine]
    Client = Client
